#include <iostream>
using namespace std;

int main() {
    double A, B, C;
    cout << "Введите A, B, C:" << endl;
    cin >> A >> B >> C;

    // Пример ветвления без повторяющихся действий с разницей лишь в переменной:
    if ((A >= 2.0 && A <= 7.5) && (B >= 2.0 && B <= 7.5) && (C >= 2.0 && C <= 7.5)) {
        A = 0; B = 0; C = 0;
    }
    else if ((A >= 2.0 && A <= 7.5) && (B >= 2.0 && B <= 7.5)) {
        A = 0; B = 0; 
    }
    else if ((A >= 2.0 && A <= 7.5) && (C >= 2.0 && C <= 7.5)) {
        A = 0; C = 0;
    }
    else if ((B >= 2.0 && B <= 7.5) && (C >= 2.0 && C <= 7.5)) {
        B = 0; C = 0;
    }
    else if (A >= 2.0 && A <= 7.5) {
        A = 0;
    }
    else if (B >= 2.0 && B <= 7.5) {
        B = 0;
    }
    else if (C >= 2.0 && C <= 7.5) {
        C = 0;
    }
    else if ((A >= -2.0 && A <= -0.5) && (B >= -2.0 && B <= -0.5) && (C >= -2.0 && C <= -0.5)) {
        A *= 2; B *= 2; C *= 2;
    }
    else if ((A >= -2.0 && A <= -0.5) && (B >= -2.0 && B <= -0.5)) {
        A *= 2; B *= 2;
    }
    else if ((A >= -2.0 && A <= -0.5) && (C >= -2.0 && C <= -0.5)) {
        A *= 2; C *= 2;
    }
    else if ((B >= -2.0 && B <= -0.5) && (C >= -2.0 && C <= -0.5)) {
        B *= 2; C *= 2;
    }
    else if (A >= -2.0 && A <= -0.5) {
        A *= 2;
    }
    else if (B >= -2.0 && B <= -0.5) {
        B *= 2;
    }
    else if (C >= -2.0 && C <= -0.5) {
        C *= 2;
    }
    // Иначе без изменений

    cout << "Результаты:" << endl << "A="<< A << " B=" << B << " C=" << C << endl;
    return 0;
}
// test